gangleri/pipenv
lukechilds/zsh-better-npm-completion
greymd/docker-zsh-completion
srijanshetty/zsh-pip-completion
esc/conda-zsh-completion
MichaelAquilina/zsh-autoswitch-virtualenv
laggardkernel/git-ignore
zpm-zsh/ssh
zsh-users/zsh-syntax-highlighting
lukechilds/zsh-nvm
Ynjxsjmh/zsh-poetry
maximux13/zsh-auto-source-file
Albatrosicks/go-task-completions
helix-editor/helix path:contrib/completion kind:fpath
rgcr/m-cli path:completion/zsh kind:fpath
mrjohannchang/zsh-interactive-cd
joshskidmore/zsh-fzf-history-search

# initilize own complitions
belak/zsh-utils path:completion

# initilize broken complitions (doesn't work before plugin manager)
akoenig/npm-run.plugin.zsh

romkatv/powerlevel10k
lincheney/fzf-tab-completion path:zsh
