tap "fabianishere/personal"
tap "felixkratz/formulae"
tap "fluxcd/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "iloveitaly/tap"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "laishulu/macism"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "minio/stable"
tap "mongodb/brew"
tap "wernerturing/multi-delogo"
# Manage compile and link flags for libraries
brew "pkg-config"
# Simple, modern, secure file encryption
brew "age"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Platform built on V8 to build network applications
brew "node"
# Language Server for Ansible Files
brew "ansible-language-server"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Download with resuming and segmented downloading
brew "aria2"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# CLI to interpret traceroute -a output to show AS names traversed
brew "asroute"
# Text processing system for reStructuredText
brew "docutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# GNU compiler collection
brew "gcc"
# Optimized BLAS library
brew "openblas"
# Cross-platform make
brew "cmake"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Tool for exploring each layer in a docker image
brew "dive"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Tools for browsing and manipulating docker registries
brew "docker-ls"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# GNU Emacs text editor
brew "emacs"
# ESP8266 and ESP32 serial bootloader utility
brew "esptool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Libav/ffmpeg based source library and Avisynth plugin
brew "ffms2"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Language server for the Go language
brew "gopls"
# Ping, but with a graph
brew "gping"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Post-modern modal text editor
brew "helix"
# Command-line hex viewer
brew "hexyl"
# Handshake Daemon & Full Node
brew "hsd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Development kit for the Java programming language
brew "openjdk@11"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# PlayStation Portable emulator
brew "ppsspp"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Password generator
brew "pwgen"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Cross-platform application and UI framework
brew "qt@5"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Rsync for cloud storage
brew "rclone"
# RC file (dotfile) management
brew "rcm"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Build applications with serverless architectures
brew "serverless"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Source-code syntax highlighter
brew "source-highlight"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# TCP connect to the given IP/port combo
brew "tcping"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Tool to build, change, and version infrastructure
brew "terraform"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Command-line interface for Vercel
brew "vercel-cli"
# Pager/text based browser
brew "w3m"
# Generate WireGuard profile from Cloudflare Warp account
brew "wgcf"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Access X11 clipboards from the command-line
brew "xclip"
# XML command-line utilities
brew "xmlstarlet"
# JavaScript package manager
brew "yarn"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "fabianishere/personal/pam_reattach"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Flux CLI
brew "fluxcd/tap/flux"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# MacOS Input Source Manager
brew "laishulu/macism/macism"
# An interactive JavaScript command-line interface to MongoDB
brew "mongodb/brew/mongodb-community-shell"
# Command-line interface for 1Password
cask "1password-cli", args: { appdir: "/Applications" }
# Converts video, audio and images
cask "adapter"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8", args: { appdir: "/Applications" }
# Spreadsheet-database hybrid cloud collaboration
cask "airtable"
# GPU-accelerated terminal emulator
cask "alacritty"
# Android SDK component
cask "android-platform-tools", args: { appdir: "/Applications" }
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organizer
cask "bartender"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Desktop password and login vault
cask "bitwarden"
# 3D creation suite
cask "blender"
# Desktop wrapper for OpenAI ChatGPT
cask "chatgpt"
# System cleaner for logs, caches and more
cask "clean-me"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Run Stable Diffusion locally
cask "diffusionbee"
# Bitcoin thin client
cask "electrum"
# Matrix collaboration client
cask "element"
# Launcher for *Epic Games* games
cask "epic-games"
# Status monitoring
cask "eul"
# Open source container development tool
cask "finch"
# App that shows GitHub notifications on the desktop
cask "gitify"
# Client for the Google Drive storage service
cask "google-drive", args: { appdir: "/Applications" }
# Open-source video transcoder
cask "handbrake"
# Tool to optimize images to a smaller size
cask "imageoptim"
# iPhone management application
cask "imazing"
# System monitoring app
cask "istat-menus"
# Third-party app to use Netflix outside the browser
cask "jellybeansoup-netflix"
# Instant shortcut lookup
cask "keycombiner"
# Open source code editor written in Rust
cask "lapce"
# Utility that shows the latest app updates
cask "latest"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Kubernetes IDE
cask "lens"
# App to manage software development and track bugs
cask "linear-linear"
# Software for Logitech devices
cask "logi-options-plus"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Provides updates to various Microsoft products
cask "microsoft-auto-update", args: { appdir: "/Applications" }
# Untraceable cryptocurrency wallet
cask "monero-wallet"
# Minecraft launcher
cask "multimc"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Native code editor
cask "nova"
# MikroTik Winbox
cask "nrlquaker-winbox"
# Real-time strategy game engine for Westwood games
cask "openra"
# WebKit based web browser
cask "orion"
# Rhythm game
cask "osu"
# Tool to create and manage Outline servers, powered by Shadowsocks
cask "outline-manager"
# Read/write support for NTFS formatted volumes
cask "paragon-ntfs", args: { appdir: "/Applications" }
# Peer to peer Bitorrent client
cask "qbittorrent"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode", args: { appdir: "/Applications" }
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize", args: { appdir: "/Applications" }
# QuickLook generator for Markdown files
cask "qlmarkdown", args: { appdir: "/Applications" }
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo", args: { appdir: "/Applications" }
# List out the contents of a zip file in the QuickLook preview
cask "qlzipinfo"
# QuickLook plugin for JSON files
cask "quicklook-json", args: { appdir: "/Applications" }
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase", args: { appdir: "/Applications" }
# Control your tools with a few keystrokes
cask "raycast"
# Keyboard-driven cursor actuator
cask "scoot"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Native Discord client built in Swift
cask "swiftcord"
# Real time file synchronization software
cask "syncthing"
# Quicklook extension for source files
cask "syntax-highlight"
# Remote access and connectivity software focused on security
cask "teamviewer", args: { appdir: "/Applications" }
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Keyboard configurator
cask "via"
# RSS and Atom reader
cask "vienna"
# Virtualizer for x86 hardware
cask "virtualbox", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Virtual machine client
cask "vmware-horizon-client"
# Wine wrapper built with SwiftUI
cask "whisky"
# SSH/SFTP/Shell/Telnet/Serial terminal
cask "windterm"
# Comic reader
cask "yacreader"
# Web browser
cask "yandex"
# App wrapper for music.youtube.com
cask "yt-music"
# Multiplayer code editor
cask "zed"
# Mesh VPN client
cask "zerotier-one"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Anybox", id: 1593408455
mas "Apple Configurator", id: 1037126344
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "Craft", id: 1487937127
mas "Dark Mode for Safari", id: 1397180934
mas "Developer", id: 640199958
mas "Discovery", id: 1381004916
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "Keynote", id: 409183694
mas "Ledger Extension", id: 1627727841
mas "LyricsX", id: 1254743014
mas "Microsoft Remote Desktop", id: 1295203466
mas "NoMouseAllowed", id: 1291268168
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Omnivore", id: 1564031042
mas "Outline", id: 1356178125
mas "Pages", id: 409201541
mas "ReadKit", id: 1615798039
mas "Refined GitHub", id: 1519867270
mas "Select Like A Boss For Safari", id: 1437310115
mas "Sleipnir", id: 475299388
mas "SponsorBlock for YouTube - Skip Sponsorships", id: 1573461917
mas "Tampermonkey", id: 1482490089
mas "Things", id: 904280696
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
vscode "moalamri.inline-fold"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "svelte.svelte-vscode"
vscode "vscode-icons-team.vscode-icons"
